## What is Graph Data Modeling?

You must collaboratively work with your stakeholders to design a graph that will:
- Answer the key use cases for the application.
- Provide the best Cypher statement performance for the key use cases.

## Data modeling process
Here are the steps to create a graph data model:
- Understand the domain and define specific use cases (questions) for the application.
- Develop the initial graph data model:
- Model the nodes (entities).
- Model the relationships between nodes.
- Test the use cases against the initial data model.
- Create the graph (instance model) with test data using Cypher.
- Test the use cases, including performance against the graph.
- Refactor (improve) the graph data model due to a change in the key use cases or for performance reasons.
- Implement the refactoring on the graph and retest using Cypher.

Refactoring is **very common** in the development process. A Neo4j graph has an optional schema which is quite flexible, unlike the schema in an RDBMS. A Cypher developer can easily modify the graph to represent an improved data model.

## The Domain
Understanding the domain for your application.Before you begin the data modeling process you must:
- Identify the stakeholders and developers of the application.
- With the stakeholders and developers:
- Describe the application in detail.
- Identify the users of the application (people, systems).
- Agree upon the use cases for the application.
- Rank the importance of the use cases.
## Use cases
Most use cases for an application can be enumerated by a comprehensive list of questions. The use cases help to define how the application will behave at runtime.
Here are the use cases you will be working with to develop the initial graph data model:

- What people acted in a movie?
- What person directed a movie?
- What movies did a person act in?
- How many users rated a movie?
- Who was the youngest person to act in a movie?
- What role did a person play in a movie?
- What is the highest rated movie in a particular year according to imDB?
- What drama movies did an actor act in?
- What users gave a movie a rating of 5?


## Purpose of the Model
When performing the graph data modeling process for an application, you will need at least two types of models:
- Data model
- Instance model

### Data model
The data model describes the labels, relationships, and properties for the graph. It does not have specific data that will be created in the graph.
Here is an example of a data model:
![image](https://github.com/user-attachments/assets/ee5f524d-21d1-4eeb-888c-84b544516e32)

### Style guidelines for modeling
- A label is a single identifier that begins with a capital letter and can be CamelCase.
Examples: Person, Company, GitHubRepo
- A relationship type is a single identifier that is in all capital letters with the underscore character.
 Examples: FOLLOWS, MARRIED_TO
- A property key for a node or a relationship is a single identifier that begins with a lower-case letter and can be camelCase.
 Examples: deptId, firstName

## Instance model
An important part of the graph data modeling process is to test the model against the use cases. To do this, you need to have a set of sample data that you can use to see if the use cases can be answered with the model.
Here is an example of an instance model:
![image](https://github.com/user-attachments/assets/6d6cde97-55db-4e4a-84ab-e1baf7f50eee)


# Modeling Nodes
## Defining labels
In the Movie domain, we use the nouns in our use cases to define the labels, for example:
- What people acted in a movie?
- What person directed a movie?
- What movies did a person act in?
Here are some of the labeled nodes that we will start with.
![image](https://github.com/user-attachments/assets/fbe1b1b1-0a2b-4821-ace4-4657672ff2cf)
## Node properties
Node properties are used to:
- Uniquely identify a node.
- Answer specific details of the use cases for the application.
- Return data.
For example, in a Cypher statement, properties are used to:
- Anchor (where to begin the query). `MATCH (p:Person {name: 'Tom Hanks'})-[:ACTED_IN]-(m:Movie) RETURN m`
- Traverse the graph (navigation). `MATCH (p:Person)-[:ACTED_IN]-(m:Movie {title: 'Apollo 13'})-[:RATED]-(u:User) RETURN p,u`
- Return data from the query. `MATCH (p:Person {name: 'Tom Hanks'})-[:ACTED_IN]-(m:Movie) RETURN m.title, m.released`

In the Movie graph, we use the following properties to uniquely identify our nodes:
- Person.tmdbId
- Movie.tmdbId

|Use case | Steps required |
|---|---|
| 1: What people acted in a movie? | Retrieve a movie by its title. Return the names of the actors.|
| 2: What person directed a movie? | Retrieve a movie by its title. Return the name of the director.|
| 3: What movies did a person act in? | Retrieve a person by their name. Return the titles of the movies.|
| Who was the youngest person to act in a movie? | Retrieve a movie by its title. Evaluate the ages of the actors. Return the name of the actor.|
| What is the highest rated movie in a particular year according to imDB? |Retrieve all movies released in a particular year. Evaluate the imDB ratings. Return the movie title.|
| What drama movies did an actor act in? | Retrieve the actor by name. Evaluate the genres for the movies the actor acted in. Return the movie titles.|

Given the details of the steps of these use cases, here are the properties we will define for the Movie nodes:
- Movie.title (string)
- Movie.released (date)
- Movie.imdbRating (decimal between 0-10)
- Movie.genres (list of strings)
Here are the properties we will define for the Person nodes:
- Person.name (string)
- Person.born (date)
- Person.died (date)

Note: The died property will be optional.

Here is the initial data model:
![image](https://github.com/user-attachments/assets/cef5c62b-663f-4a7e-82e3-574ffbaadc60)

And here is the initial instance model you will be creating:

![image](https://github.com/user-attachments/assets/485e3fb6-8580-4a78-9caa-378ea9c112eb)


