## Testing the Model
So far, you can design the data model on paper, a whiteboard, or with a tool like [Arrows app](https://arrows.app/). 
In testing we test our created Graph DB against the use cases as below:
- Use case #1. What people acted in a movie?
```
MATCH (p:Person)-[:ACTED_IN]-(m:Movie)
WHERE m.title = 'Sleepless in Seattle'
RETURN p.name AS Actor
```
A really important factor with testing the graph is **scalability**. How will these queries perform if the graph has millions of nodes or relationships? 

## Testing with Instance Model

![image](https://github.com/user-attachments/assets/378a3a06-e41f-4aed-9866-d136449ca150)

- Use case #2: What person directed a movie?
```
MATCH (p:Person)-[:DIRECTED]-(m:Movie)
WHERE m.title = 'Hoffa'
RETURN  p.name AS Director
```
- Use case #3: What movies did a person act in?
```
MATCH (p:Person)-[:ACTED_IN]-(m:Movie)
WHERE p.name = 'Tom Hanks'
RETURN m.title AS Movie
```
- Use case #4: How many users rated a movie?
```
MATCH (u:Users)-[:RATED]->(m:Movie)
WHERE m.title = "Inception"
RETURN COUNT(*) AS Number of Reviwers
```
- Use case #5: Who was the youngest person to act in a movie?
```
MATCH (p:Person)-[:ACTED_IN]->(m:Movie)
WHERE m.title = 'Hoffa'
RETURN  p.name AS Actor, p.born as `Year Born` ORDER BY p.born DESC LIMIT 1
```
- Use case #6: What role did a person play in a movie?
```
MATCH (p:Person)-[r:ACTED_IN]->(m:Movie)
WHERE p.name = 'Meg Ryan' AND m.title ='Hoffa'
RETURN r.role AS Role
```
- Use case #7: What is the highest rated movie in a particular year according to imDB?
```
MATCH (p:Person)-[r:RATED]->(m:Movie)
WHERE m.released STARTS WITH '1990'
RETURN m.title AS Movies, r.imdbRating as Ratings ORDER BY r.imdbRating DESC LIMIT 1
```
- Use case #8: What drama movies did an actor act in?
```
MATCH (p:Person)-[:ACTED_IN]->(m:Movie)
WHERE p.name = 'Tom Hanks' AND 'Drama' IN m.genres
RETURN m.title AS Movie
```
- Use case #9: What users gave a movie a rating of 5?
```
MATCH (u:User)-[r:RATED]->(m:Movie)
WHERE r.rating = 5 AND m.title = 'Apollo 13'
RETURN u.name as Reviewer
```


