# Using specific realtionship
Neo4j as a native graph database is implemented to traverse relationships quickly. In some cases, it is more performant to query the graph based upon relationship types, rather than properties in the nodes.
### Use case #12: What movies did an actor act in for a particular year?
```
//query for use case
MATCH (p:Actor)-[:ACTED_IN]-(m:Movie)
WHERE p.name = 'Tom Hanks' AND
m.released STARTS WITH '1995'
RETURN m.title AS Movie
```
What if Tom Hanks acted in a total of 1000 movies? All of these Movie nodes would need to be evaluated.

### Use case #13: What actors or directors worked in a particular year?
```
// Query for use case
MATCH (p:Person)--(m:Movie)
WHERE  m.released STARTS WITH '1995'
RETURN DISTINCT p.name as `Actor or Director`
```
This query is even worse for performance because in order to return results, it must retrieve all Movie nodes
You can imagine, if the graph contained millions of movies,

## Refactoring to specialize relationships
**Relationships are fast to traverse and they do not take up a lot of space in the graph**
So, for example, in addition to the ACTED_IN and DIRECTED relationships, we add relationships that have year information.
- ACTED_IN_1992
- ACTED_IN_1993
- ACTED_IN_1995
- DIRECTED_1992
- DIRECTED_1995

At first, it seems like a lot of relationships for a large, scaled movie graph, but if the latest two new queries are important use cases, it is worth it.
The code to refactor the graph to add these specialized relationships uses the APOC library.
```
// Get all actor and movies has relatioship
MATCH (n:Actor)-[:ACTED_IN]->(m:Movie)
//
CALL apoc.merge.relationship(n,
  'ACTED_IN_' + left(m.released,4),
  {},
  {},
  m ,
  {}
) YIELD rel
// Return relatioship creation count
RETURN count(*) AS `Number of relationships merged`;
```

New query after refactor. For this query the specific relationship is traversed, but fewer Movie nodes are retrieved
```
MATCH (p:Actor)-[:ACTED_IN_1995]-(m:Movie)
WHERE p.name = 'Tom Hanks'
RETURN m.title AS Movie
```
And here is how we rewrite the second query:
```
MATCH (p:Person)-[:ACTED_IN_1995|DIRECTED_1995]-()
RETURN p.name as `Actor or Director`
```

### Q1: Why do you refactor a graph to specialize relationships?
-  Reduce the number of nodes that need to be retrieved.
-  Improve query performance.

### Q2: How do you create dynamic relationships?
-  Use the APOC library.


## Specializing RATED Relationships
Suppose we wanted to improve the performance of this query:
Use case #9: What users gave a movie a rating of 5?
```
MATCH (u:User)-[r:RATED]->(m:Movie)
WHERE m.title = 'Apollo 13' AND
r.rating = 5
RETURN u.name as Reviewer
```
What if there were thousands of Users in the graph. This query would need to traverse all RATED relationships and evaluate the rating property. For a large graph, more evaluations mean longer query processing time.
Solution: Creating specialized RATED_{rating} Relationships

```
MATCH (u:User)-[r:RATED]->(m:Movie)
CALL apoc.merge.relationship(u,
  'RATED_' + r.rating,
  {},
  {},
  m ,
  {}
) YIELD rel
RETURN count(*) AS `Number of relationships merged`
```

## Adding Intermediate Nodes

You sometimes find cases where you need to connect more data to a relationship than can be fully captured in the properties. In other words, you want a relationship that connects more than two nodes. Mathematics allows this, with the concept of a hyperedge. A solution to hyperedges in Neo4j is to create intermediate nodes.

You create intermediate nodes when you need to:
- Connect more than two nodes in a single context.
- Hyperedges (n-ary relationships)
- Relate something to a relationship.
- Share data in the graph between entities.

### These three use cases are used to make the graphs relationships more meaningful and sharable between nodes.

- Need for intermediate nodes
Wanted to know during which period what was the employee role . Here we have the WORKS_AT hyperedge.
![image](https://github.com/user-attachments/assets/ee702b6f-2c28-42f5-a5ba-f650609a9e6c)
Adding an intermediate node to the model
![image](https://github.com/user-attachments/assets/c2763f5e-2b01-442e-a81c-8c7ca4c36d15)
The solution is to replace the hyperedge with a connection point node. 

- Intermediate nodes for sharing data
Relationship stores duplicate data
![image](https://github.com/user-attachments/assets/fa7956be-e6bb-4251-9008-8d678e88c1dd)
Intermediate nodes also allow you to deduplicate information. In this case, the Email intermediate node spares us having to repeat the email content on every single relationship.
![image](https://github.com/user-attachments/assets/13526497-f4ed-4249-9f11-8adf0f98e9a2)

- Intermediate nodes for the movie graph
We might want to analyze how different roles interact with each other, even across different movies. Common role across movies 

## Adding a Role Node

Proposed instance model:
![image](https://github.com/user-attachments/assets/0f9c3c77-671f-42ee-886d-37fcc4d8f965)

Write and run refactor code to:
- Find an actor that acted in a Movie (MATCH (a:Actor)-[r:ACTED_IN]→(m:Movie))
- Create (using MERGE) a Role node setting it’s name to the role in the ACTED_IN relationship.
- Create (using MERGE) the PLAYED relationship between the Actor and the Role nodes.
- Create (using MERGE) the IN_MOVIE relationship between the Role and the Movie nodes.
```
MATCH (a:Actor)-[r:ACTED_IN]→(m:Movie)
MERGE (n:Role {name:r.role})
MERGE (m)<-[:IN_MOVIE]-()
```

